const Info = () => {
  return (
    <div className="text-right result_comp_style" style={{ gridArea: "info" }}>
      <p className="h5">
        معدل دوران الخلايا في بشرتك بطيء نسبياً
        <br />
        <br />
        بشرتك تحتاج كمية كبيرة من الريتينول بنسبة 25%، بسبب افتقار بشرتك
        لفيتامين أ والذي يؤدي دوراََ كبيراََ في القضاء على التصبغات الجلدية
        والندوب ويعمل على:
      </p>
      <ul className="my-3 w-100" style={{ paddingRight: "3rem" }}>
        <li>إعادة بناء الخلايا التالفة في البشرة</li>
        <li>محاربة التجاعيد والخطوط الرفيعة</li>
        <li>منح البشرة النضارة ومحاربة البهتان</li>
        <li>مكافحة البثور وتنظيف المسامات الواسعة</li>
        <li>معالجة التصبغات وندوب حب الشباب</li>
        <li>محاربة الجفاف وترطيب البشرة</li>
      </ul>
      <p className="h5">
        بالاضافة إلى كولاجين بنسبة 37%، بسبب تحويل نسبة كبيرة من الكولاجين التي
        يمتصها الجسم لأحماض أمينية لتغذية باقي الجسد بدون التأثير على الجلد،
        ولذلك يجب امداد البشرة بالكولاجين وذلك لأجل :
      </p>
      <ul className="my-3 w-100" style={{ paddingRight: "3rem" }}>
        <li>القضاء على خطوط الوجه والتجاعيد</li>
        <li>إبراز الشفايف والخدود بمظهر أكثر امتلاء</li>
        <li>القضاء على الخطوط البيضاء والسيلوليت في أجزاء الجسم المختلفة</li>
        <li>توحيد لون البشرة والقضاء على البقع الداكنة</li>
        <li>ترقيق وتنعيم الجلد</li>
      </ul>
      <p className="h5">
        25% من الالوفيرا والشاي الاخضر: لاحتوائهم على فيتامينات ومعادن ومضادات
        اكسده لمحاربة علامات التقدم في السن المبكره ومنع تكون الرئوس السوداء
        والحد من البثور والتصبغات.
      </p>
    </div>
  );
};

export default Info;
