import { BsCheck } from "react-icons/bs";

const Info = () => {
  const content = [
    {
      head: "الريتينول بنسبة 25%",
      secTxt:
        "بسبب افتقار بشرتك لفيتامين أ والذي يؤدي دوراََ   كبيراََ في القضاء على التصبغات الجلدية والندوب ويعمل على:",
      listItems: [
        "إعادة بناء الخلايا التالفة في البشرة",
        "محاربة التجاعيد والخطوط الرفيعة",
        "منح البشرة النضارة ومحاربة البهتان",
        "مكافحة البثور وتنظيف المسامات الواسعة",
        "معالجة التصبغات وندوب حب الشباب",
        "محاربة الجفاف وترطيب البشرة",
      ],
    },
    {
      head: "كولاجين بنسبة 37%",
      secTxt:
        "بسبب تحويل نسبة كبيرة من الكولاجين التي يمتصها الجسم لأحماض أمينية لتغذية باقي الجسد بدون التأثير على الجلد، ولذلك يجب امداد البشرة بالكولاجين وذلك لأجل :",
      listItems: [
        "إعادة بناء الخلايا التالفة في البشرة",
        "محاربة التجاعيد والخطوط الرفيعة",
        "منح البشرة النضارة ومحاربة البهتان",
        "مكافحة البثور وتنظيف المسامات الواسعة",
        "معالجة التصبغات وندوب حب الشباب",
        "محاربة الجفاف وترطيب البشرة",
      ],
    },
    {
      head: "25% من الالوفيرا والشاي الاخضر",
      secTxt:
        ": لاحتوائهم على فيتامينات ومعادن ومضادات اكسده لمحاربة علامات التقدم في السن المبكره ومنع تكون الرئوس السوداء والحد من البثور والتصبغات.",
    },
  ];
  const retanolCauses = [
      "إعادة بناء الخلايا التالفة في البشرة",
      "محاربة التجاعيد والخطوط الرفيعة",
      "منح البشرة النضارة ومحاربة البهتان",
      "مكافحة البثور وتنظيف المسامات الواسعة",
      "معالجة التصبغات وندوب حب الشباب",
      "محاربة الجفاف وترطيب البشرة",
    ],
    colaginCauses = [
      "القضاء على خطوط الوجه والتجاعيد",
      "إبراز الشفايف والخدود بمظهر أكثر امتلاء",
      "القضاء على الخطوط البيضاء والسيلوليت في أجزاء الجسم المختلفة",
      "توحيد لون البشرة والقضاء على البقع الداكنة",
      "ترقيق وتنعيم الجلد",
    ];

  return (
    <div
      className="text-right result_comp_style mb-4"
      style={{ gridArea: "info" }}
    >
      <p className="h5">
        معدل دوران الخلايا في بشرتك بطيء نسبياً
        <br />
        بشرتك تحتاج كمية كبيرة من
        <br />
      </p>
      {content.map((c, i) => {
        return (
          <div className="my-3">
            <p className="h3 text-center mb-3" style={{ fontWeight: "600" }}>
              {c.head}
            </p>
            <p className="text-center" style={{ color: "rgb(95, 100, 226)" }}>
              {c.secTxt}
            </p>

            {c.listItems && (
              <ul className="my-3 w-100">
                {c.listItems.map((c, i) => {
                  return (
                    <li key={i} className="pb-2" style={listStyle}>
                      <BsCheck className="bg-prime text-white ml-3" />
                      {c}
                    </li>
                  );
                })}
              </ul>
            )}
          </div>
        );
      })}
      {/* <p className="h5">
        معدل دوران الخلايا في بشرتك بطيء نسبياً
        <br />
        بشرتك تحتاج كمية كبيرة من
        <br />
      </p>
      <p className="h5 text-center">الريتينول بنسبة 25%</p>
      <p className="text-center">
        بسبب افتقار بشرتك لفيتامين أ والذي يؤدي دوراََ كبيراََ في القضاء على
        التصبغات الجلدية والندوب ويعمل على:
      </p>
      <ul className="my-3 w-100">
        {retanolCauses.map((c, i) => {
          return (
            <li key={i} className="pb-2" style={listStyle}>
              <BsCheck className="bg-prime text-white ml-3" />
              {c}
            </li>
          );
        })}
      </ul>
      <p className="h5">
        بالاضافة إلى كولاجين بنسبة 37%، بسبب تحويل نسبة كبيرة من الكولاجين التي
        يمتصها الجسم لأحماض أمينية لتغذية باقي الجسد بدون التأثير على الجلد،
        ولذلك يجب امداد البشرة بالكولاجين وذلك لأجل :
      </p>
      <ul className="my-3 w-100">
        <li>القضاء على خطوط الوجه والتجاعيد</li>
        <li>إبراز الشفايف والخدود بمظهر أكثر امتلاء</li>
        <li>القضاء على الخطوط البيضاء والسيلوليت في أجزاء الجسم المختلفة</li>
        <li>توحيد لون البشرة والقضاء على البقع الداكنة</li>
        <li>ترقيق وتنعيم الجلد</li>
      </ul>
      <p className="h5">
        25% من الالوفيرا والشاي الاخضر : لاحتوائهم على فيتامينات ومعادن ومضادات
        اكسده لمحاربة علامات التقدم في السن المبكره ومنع تكون الرئوس السوداء
        والحد من البثور والتصبغات.
      </p> */}
    </div>
  );
};

const listStyle = {
  listStyle: "none",
  paddingRight: "1rem",
};

export default Info;
